{
  "courses": [
    {
      "id": "c3af8206-2fbd-4f21-8755-7b0157b5045e",
      "description": "This course will introduce students to the fundamental concepts and practices of Financial Accounting. Students are expected to become adept at performing the functions related to the accounting cycle, including the preparation of financial statements.",
      "code": "ACCT1220",
      "department": "ACCT",
      "number": 1220,
      "name": "Intro Financial Accounting",
      "credits": 0.5,
      "offerings": "Also  offered through Distance Education  format.",
      "restrictions": "ACCT*2220. This is a  Priority Access Course. Enrolment may be  restricted to particular programs or  specializations. See department for more  information.",
      "departments": "Department of  Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Summer, Fall, and Winter, All Years",
      "sections": []
    },
    {
      "id": "e50659f9-beee-4408-b393-055dd3824ba4",
      "description": "This course requires students to apply the fundamental principles emanating from accounting's conceptual framework and undertake the practice of financial accounting. Students will become adept at performing the functions related to each step in the accounting cycle, up to and including the preparation of the financial statements and client reports. Students will also develop the skills necessary for assessing an organization's system of internal controls and financial conditions.",
      "code": "ACCT1240",
      "department": "ACCT",
      "number": 1240,
      "name": "Applied Financial Accounting",
      "credits": 0.5,
      "offerings": "Also offered through Distance Education format.",
      "restrictions": "ACCT*2240. This is a Priority Access Course. Enrolment may be restricted to particular programs or specializations. See department for more  information.",
      "departments": "Department of  Management",
      "requisites": "ACCT*1220 or ACCT*2220   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter Only, All Years",
      "sections": []
    },
    {
      "id": "98c4cd7c-a83d-45ec-9f91-a73672354d26",
      "description": "This course emphasizes the use of accounting information to facilitate effective management decisions. Topics include cost determination, cost control and analysis, budgeting, profit-volume analysis and capital investment analysis.",
      "code": "ACCT2230",
      "department": "ACCT",
      "number": 2230,
      "name": "Management Accounting",
      "credits": 0.5,
      "equates": "AGEC*2230,  BUS*2230",
      "restrictions": "This is a Priority  Access Course. Enrolment may be restricted to  particular programs or specializations. See  department for more information.",
      "departments": "Department of Management",
      "requisites": "ACCT*1220 or ACCT*2220   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Fall and Winter, All Years",
      "sections": []
    },
    {
      "id": "bc3bb64b-8778-45c8-aae6-2b18acc591aa",
      "description": "This course continues the managerial decision making focus of ACCT*2230. Topics include process costing, transfer pricing, the decision making process, variances and performance measurement.",
      "code": "ACCT3230",
      "department": "ACCT",
      "number": 3230,
      "name": "Intermediate Mgmt Accounting",
      "credits": 0.5,
      "offerings": "Also offered through Distance  Education format.",
      "equates": "BUS*3230",
      "restrictions": "Enrolment may be  restricted to particular degrees or programs. See  department for more information.",
      "departments": "Department of Management",
      "requisites": "ACCT*2230   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter and Summer, All Years",
      "sections": []
    },
    {
      "id": "7ee0923c-621b-46c5-b650-7162ff0bda2e",
      "description": "Auditing I is an examination of the principles and theory underlying the practice of auditing. Concepts of materiality and audit risk are examined and discussed. Sources and techniques for gathering auditing evidence will also be examined. Modern organizations rely on information systems, technology and internal controls to manage and monitor their operations and the impact of these systems on the quality of information produced and on the scope of audits are important elements of this course.",
      "code": "ACCT3280",
      "department": "ACCT",
      "number": 3280,
      "name": "Auditing I",
      "credits": 0.5,
      "departments": "Department of Management",
      "requisites": "ACCT*3330   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Summer and Fall, All Years",
      "sections": []
    },
    {
      "id": "f110ab87-83c5-40be-96a1-fae285f0bbcf",
      "description": "This course presents a critical evaluation of accounting concepts, principles and practices in relation to both the traditional and current value accounting measurement models. Emphasis will be on the effect of alternative accounting practices and measurement models on income determination and asset valuation.",
      "code": "ACCT3330",
      "department": "ACCT",
      "number": 3330,
      "name": "Intermed Financial Account I",
      "credits": 0.5,
      "offerings": "Also offered through Distance Education  format.",
      "equates": "BUS*3330",
      "restrictions": "This is a Priority Access Course. Enrolment may  be restricted to particular programs or  specializations. See department for more  information.",
      "departments": "Department of  Management",
      "requisites": "ACCT*1220 or ACCT*2220   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Fall and Winter, All Years",
      "sections": []
    },
    {
      "id": "d155c5d4-a9f4-47ae-b7a2-c17ee363dc76",
      "description": "This course focuses on how entities account for current and non-current liabilities and equity accounts, including, income taxes, leases, pensions and other post retirement benefits, share equity and retained earnings, stock options. Additional topics may include earnings per share, restatements and statement analysis.",
      "code": "ACCT3340",
      "department": "ACCT",
      "number": 3340,
      "name": "Intermed Financial Account II",
      "credits": 0.5,
      "departments": "Department of Management",
      "requisites": "ACCT*3330   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Summer and Fall, All Years",
      "sections": []
    },
    {
      "id": "ad1a1449-c520-4cf8-80f0-ee750efb26e1",
      "description": "The fundamentals of the tax system as it applies to all taxpayers will be the focus of the first half of the course. The second half will develop forms of business organizations from a tax perspective. Basic tax planning techniques which attempt to maximize the cash flows and returns on investments will then be studied. The emphasis in the course is on business decision making. A review of personal financial planning and investment decisions will also be included.",
      "code": "ACCT3350",
      "department": "ACCT",
      "number": 3350,
      "name": "Taxation",
      "credits": 0.5,
      "restrictions": "This is a Priority Access Course. Enrolment may be restricted to  particular degrees or programs. See the  department for more information.",
      "departments": "Department of Management",
      "requisites": "ACCT*3330   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Summer and Fall, All Years",
      "sections": []
    },
    {
      "id": "68bb5b41-0ac0-4319-b61b-be48d807a38b",
      "description": "This course is a critical evaluation of issues and problems associated with business combinations, long-term intercorporate investments, foreign operations and accounting for not-for-profit organizations. There is a strong emphasis on applying this body of knowledge through practical problems.",
      "code": "ACCT4220",
      "department": "ACCT",
      "number": 4220,
      "name": "Advanced Financial Accounting",
      "credits": 0.5,
      "equates": "BUS*4220",
      "restrictions": "Enrolment may be  restricted to particular degrees or programs. See  the department for more  information.",
      "departments": "Department of  Management",
      "requisites": "(ACCT*3330 or BUS*3330), (ACCT*3340 or BUS*3340)   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Fall Only, All Years",
      "sections": []
    },
    {
      "id": "f7e7e807-ce32-4874-8261-5d712f3ecafb",
      "description": "This course provides advanced coverage of management accounting concepts and the application of management accounting information for managerial decision-making. This course extends the concepts covered in intermediate management accounting and also integrates pertinent situational problems from other functional areas of enterprises such as global trade and process controls.",
      "code": "ACCT4230",
      "department": "ACCT",
      "number": 4230,
      "name": "Advanced Management Accounting",
      "credits": 0.5,
      "equates": "BUS*4230",
      "restrictions": "This is a Priority Access Course. Enrolment may be restricted to particular degrees or programs. See the department for more information.",
      "departments": "Department of Management",
      "requisites": "ACCT*3230 or BUS*3230   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter Only, All Years",
      "sections": []
    },
    {
      "id": "ebcd4065-087b-440a-999e-c6c8e4259ec8",
      "description": "This course considers a number of advanced topics concerning both the auditor and audit techniques within the context of public accounting. It builds on the knowledge of the audit task derived in Auditing I - ACCT*3280 as well as the depth and breadth of knowledge gained in ACCT*3330 and ACCT*3340.",
      "code": "ACCT4270",
      "department": "ACCT",
      "number": 4270,
      "name": "Auditing II",
      "credits": 0.5,
      "equates": "BUS*4270",
      "departments": "Department of Management",
      "requisites": "ACCT*3280 or BUS*3280   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Fall Only, All Years",
      "sections": []
    },
    {
      "id": "a4afc96e-6978-4331-97cb-74f4a302d5d6",
      "description": "This course introduces the student to the field of auditing within a computer based environment. Students will develop an enhanced understanding of information systems, information system risks, management controls, control evaluation, audit strategies, and computer assisted audit techniques. The course will also introduce data analytic techniques used to analyze structured and unstructured data.",
      "code": "ACCT4290",
      "department": "ACCT",
      "number": 4290,
      "name": "IT Auditing & Data Analytics",
      "credits": 0.5,
      "equates": "BUS*4290",
      "departments": "Department of  Management",
      "requisites": "ACCT*3280 or BUS*4280   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter Only, All Years",
      "sections": []
    },
    {
      "id": "fabb6d33-6599-4a81-b576-359514fa9b43",
      "description": "This course will draw on accounting research, primarily empirical research. Rather than covering specific GAAP rules, the course will focus on how investors react to GAAP rules, why financial information is important, and how its use/misuse affects investor decision making and management behaviour. The course is thus about accounting, instead of about how to apply accounting standards.",
      "code": "ACCT4340",
      "department": "ACCT",
      "number": 4340,
      "name": "Accounting Theory",
      "credits": 0.5,
      "departments": "Department of Management",
      "requisites": "15.00 credits including ACCT*3340   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter Only, All Years",
      "sections": []
    },
    {
      "id": "00698f33-c8bf-402b-a28e-d9ccb242520c",
      "description": "An intensive study of the Canadian Income Tax Act and related statutes, this course will focus on the application to the taxation of individuals, partnerships and corporations. A strong emphasis will be placed on compliance and tax planning.",
      "code": "ACCT4350",
      "department": "ACCT",
      "number": 4350,
      "name": "Income Taxation II",
      "credits": 0.5,
      "equates": "BUS*4350",
      "departments": "Department  of Management",
      "requisites": "ACCT*3350 or BUS*3350   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Fall Only, All Years",
      "sections": []
    },
    {
      "id": "bd8533b4-a0e2-4e4a-8912-88357b7f4093",
      "description": "This course will help students develop an analytical approach to analyzing accounting problems and improve professional judgement. Students will apply previously-gained technical knowledge of accounting, tax, assurance, finance, and corporate governance to various financial reporting and advisory problems and scenarios. They will develop an enhanced understanding of the impact of user and preparer objectives on the selection of accounting policies, and accounting estimates in an environment of some uncertainty.",
      "code": "ACCT4440",
      "department": "ACCT",
      "number": 4440,
      "name": "Integrated Cases in Accounting",
      "credits": 0.5,
      "departments": "Department of Management",
      "requisites": "15.00 credits including ACCT*3280, ACCT*3340, ACCT*3350   - Must be completed prior to taking this course.",
      "locations": "Guelph",
      "formats": "Winter Only, All Years",
      "sections": []
    },
    {
      "id": "6a28dfa3-2770-4413-9735-f34dfeee85ff",
      "description": "\"Integrated Cases I\" is a required course for students pursuing a Chartered Professional Accountant (CPA) designation and will provide students with an in-depth knowledge of financial reporting and auditing. The course will integrate topics from both the finance and taxation areas of the CPA competency map. The course will also assist students in developing their problem solving and decision making abilities and communication skills, which are part of the enabling competencies of the CPA competency map.",
      "code": "ACCT6100",
      "department": "ACCT",
      "number": 6100,
      "name": "Integrated Cases I",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP students.",
      "departments": "Department of Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Summer Only, All Years",
      "sections": []
    },
    {
      "id": "12bfa641-a0c1-4907-b862-b327ea53acbd",
      "description": "\"Integrated Cases II\" is a required course for students pursuing a Chartered Professional Accountant (CPA) designation and will provide students with an in-depth knowledge of management accounting. The course will integrate topics from both the strategy and governance and the finance areas of the CPA competency map. The course will also assist students in developing their problem solving and decision-making abilities and communication skills, which are part of the enabling competencies of the CPA competency map.",
      "code": "ACCT6200",
      "department": "ACCT",
      "number": 6200,
      "name": "Integrated Cases II",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP students.",
      "departments": "Department of Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Summer Only, All Years",
      "sections": []
    },
    {
      "id": "fc2f5e7e-e743-4a0e-b0fa-0eea83734c4c",
      "description": "This course is intended to help students achieve the competencies related to Elective Module 4 (E4) - Taxation in the CPA Competency Map. It covers the competencies necessary to provide taxation services and guidance. Topics include: compliance and tax-planning issues for both individuals and corporate entities, as well as, partnerships and trusts, risk tolerance of all stakeholders involved, tax governance, controls, and risk management, and the importance of taking taxes into account when making business and investment decisions..",
      "code": "ACCT6300",
      "department": "ACCT",
      "number": 6300,
      "name": "Taxation",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP students.",
      "departments": "Department of  Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Summer Only, All Years",
      "sections": []
    },
    {
      "id": "ad8935c0-58fd-4c01-b7c7-ecffc63fb722",
      "description": "Performance Management is an elective course for students pursuing a Chartered Professional Accountant (CPA) designation and will build on students' management accounting knowledge from both their undergraduate courses as well as \"Integrated Cases II\". The course will also assist students in further developing their problem solving and decision-making abilities and communication skills, which are part of the enabling competencies of the CPA competency map.",
      "code": "ACCT6400",
      "department": "ACCT",
      "number": 6400,
      "name": "Performance Management",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP students.",
      "departments": "Department of Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Unspecified, All Years",
      "sections": []
    },
    {
      "id": "0cce4239-70f0-40c1-b6b3-c6bcf3d03cd1",
      "description": "This course develops the competencies necessary to assess an entity's assurance needs and perform both internal audit projects and external assurance engagements. The CPA Competency Map describes in detail the two types of competencies - technical and enabling - that employers in public practice, industry, and government require of accounting professionals. As such, the CPA Competency Map will be utilized in this course to help ensure that students meet the course learning objectives.",
      "code": "ACCT6500",
      "department": "ACCT",
      "number": 6500,
      "name": "Assurance",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP students.",
      "departments": "Department of Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Summer Only, All Years",
      "sections": []
    },
    {
      "id": "6f70bc11-b6bf-4e49-b980-290f62b44709",
      "description": "The course will build upon the conceptual foundation developed in undergraduate introductory finance courses. The focus of the course is on the development of competencies in identifying, analyzing, evaluating and making appropriate recommendations for investing and financing decisions in a variety of professional contexts, particularly in the areas of treasury management, valuation, and risk management. There will be a strong emphasis on applying the body of knowledge in integrated case problems.",
      "code": "ACCT6600",
      "department": "ACCT",
      "number": 6600,
      "name": "Financial Management",
      "credits": 0.5,
      "restrictions": "Restricted to Graduate Diploma Accounting and Management MSc coursework/MRP Management students.",
      "departments": "Department of Management",
      "requisites": "None",
      "locations": "Guelph",
      "formats": "Unspecified, All Years",
      "sections": []
    }
  ]
}